This is a test

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

df = pd.read_csv('fulfilment_center_info.csv')
df1 = pd.read_csv('meal_info.csv')
df2 = pd.read_csv('test.csv')
df3 = pd.read_csv('train.csv')

In [6]:
## Making Copies of the files
fill = df.copy()
meal = df1.copy()
test = df2.copy()
train = df3.copy()

The goal of this project will be to look at the data set for a meal delivery service and analyze the data to determine. The purpose of picking this project was to bolster join skills.

New Learned Methods
.unstack()

In [30]:
fill.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 77 entries, 0 to 76
Data columns (total 5 columns):
center_id      77 non-null int64
city_code      77 non-null int64
region_code    77 non-null int64
center_type    77 non-null object
op_area        77 non-null float64
dtypes: float64(1), int64(3), object(1)
memory usage: 3.1+ KB

In [12]:
fill.head()

   center_id  city_code  region_code center_type  op_area
0         11        679           56      TYPE_A      3.7
1         13        590           56      TYPE_B      6.7
2        124        590           56      TYPE_C      4.0
3         66        648           34      TYPE_A      4.1
4         94        632           34      TYPE_C      3.6

In [24]:
# This line of codes counts the number of centers for each region and their types
fill.groupby(['region_code', 'center_type'])['center_id'].count().unstack()

center_type  TYPE_A  TYPE_B  TYPE_C
region_code
23              1.0     NaN     NaN
34             10.0     5.0     6.0
35              1.0     NaN     NaN
56             17.0     6.0     7.0
71              1.0     NaN     NaN
77             10.0     3.0     4.0
85              2.0     1.0     2.0
93              1.0     NaN     NaN

We can see that region 56 has the bulk of the area with region 34 beind it

In [31]:
meal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 0 to 50
Data columns (total 3 columns):
meal_id     51 non-null int64
category    51 non-null object
cuisine     51 non-null object
dtypes: int64(1), object(2)
memory usage: 1.3+ KB

In [32]:
meal.head()

   meal_id   category cuisine
0     1885  Beverages    Thai
1     1993  Beverages    Thai
2     2539  Beverages    Thai
3     1248  Beverages  Indian
4     2631  Beverages  Indian

In [28]:
meal.groupby(['category','cuisine'])['meal_id'].count().unstack()

cuisine       Continental  Indian  Italian  Thai
category
Beverages             3.0     3.0      3.0   3.0
Biryani               NaN     3.0      NaN   NaN
Desert                NaN     3.0      NaN   NaN
Extras                NaN     NaN      NaN   3.0
Fish                  3.0     NaN      NaN   NaN
Other Snacks          NaN     NaN      NaN   3.0
Pasta                 NaN     NaN      3.0   NaN
Pizza                 3.0     NaN      NaN   NaN
Rice Bowl             NaN     3.0      NaN   NaN
Salad                 NaN     NaN      3.0   NaN
Sandwich              NaN     NaN      3.0   NaN
Seafood               3.0     NaN      NaN   NaN
Soup                  NaN     NaN      NaN   3.0
Starters              NaN     NaN      NaN   3.0

This shows us the number of meal ids for each cusine

In [33]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32573 entries, 0 to 32572
Data columns (total 8 columns):
id                       32573 non-null int64
week                     32573 non-null int64
center_id                32573 non-null int64
meal_id                  32573 non-null int64
checkout_price           32573 non-null float64
base_price               32573 non-null float64
emailer_for_promotion    32573 non-null int64
homepage_featured        32573 non-null int64
dtypes: float64(2), int64(6)
memory usage: 2.0 MB

In [67]:
test.groupby(['meal_id','week'])[['checkout_price']].mean().head()

              checkout_price
meal_id week
1062    146       172.535714
        147       184.152857
        148       183.941429
        149       180.909868
        150       181.686104

In [80]:
plt.figure(figsize=[14,7])
plt.subplot(1,1,1)
sb.plot(data = 'test', x =)

Top meal ids and their total checkout price

Calculate the difference between checkout vs base price
Calculate which weeks centers to the best (line graph?)
See if there is an increase in the number of sales for emailer promotion and homepage feature